Revit 2026 API
WorksharingUtils.CheckoutElements Method
Overload List
Name | Description
CheckoutElements(Document, ICollection<ElementId>)
CheckoutElements(Document, ISet<ElementId>, TransactWithCentralOptions)
Top
See Also
Reference
WorksharingUtils Class
Autodesk.Revit.DB Namespace